CREATE TABLE if not exists order_detail (
    order_id INT,
    category_name VARCHAR(50),
    product_name VARCHAR(50),
    sale_amount DECIMAL(10, 2)
);

INSERT INTO order_detail (order_id, category_name, product_name, sale_amount) VALUES
(1, '数码', '手机', 6999.00),
(2, '数码', '耳机', 899.00),
(3, '数码', '电脑', 8999.00),
(4, '数码', '平板', 3999.00),
(5, '数码', '手机', 5999.00),
(6, '服饰', '羽绒服', 1299.00),
(7, '服饰', '运动鞋', 799.00),
(8, '服饰', '牛仔裤', 399.00),
(9, '服饰', '羽绒服', 999.00),
(10, '服饰', '卫衣', 299.00),
(11, '食品', '咖啡', 199.00),
(12, '食品', '牛奶', 89.00),
(13, '食品', '坚果', 159.00),
(14, '食品', '咖啡', 299.00),
(15, '食品', '饼干', 69.00),
(16, '家电', '空调', 3299.00),
(17, '家电', '冰箱', 4599.00),
(18, '家电', '洗衣机', 2999.00),
(19, '家电', '电视', 3999.00),
(20, '家电', '冰箱', 3599.00);
